
PATH = '../newkaraites/karaites/management/tmp/'
SOURCE_PATH = '../newkaraites/data_karaites/'
OUT_PATH = PATH
CSS_SOURCE = OUT_PATH
CSS_OUT = '../newkaraites/frontend/src/css/'

# IGNORE = ['(#default#VML)',
#           '(Web)',
#           '("Yeriot%20Shelomo%20volume%201.fld/header.html")',
#           '(ששה ימים לאחר שסיים את תפקידיו במצרים)',
#           """(כפי שהיה נוהג לעשות זאת בכל הספרים שהיה מעיין בהם)""",
#           """(ששה ימים לאחר שסיים את תפקידיו במצרים)""",
#           '(ברוך)',
#           """(נגד ספר"משא קרים"לאפרים דיינגרד)""",
#           """(נגד דת הנצרות)""",
#           """(ראה הערה מספר 8)."""
#           """(כפי שהיה נוהג לעשות זאת בכל הספרים שהיה מעיין בהם)""",
#           """(נגד ספר"משא קרים"לאפרים דיינגרד)"""
#           '(בחג הסוכות)',
#           '(אַתְּ)',
#           '(הֹלֶכֶת)',
#           """(ח', י"ט)""",
#           """(וְקִבְּלוּ)""",
#           """(יַעַשׂ)""",
#           """(ראה הערה מספר 8)"""
#           # volume 2
#           """(ח', י"ט)"""
#           '(י"א,  ל"ג),',
#           '(יִהְיוּ-) ',
#           '(שָׁחוּט)',
#           '(דְּבָרוֹ)',
#           '(כ"ו, י"ט)',
#           '(רַגְלְךָ)',
#           '(הוא הנ"ל)',
#           '(ח"ב, כ"ג)',
#           """(ט', א')""",
#           """(ח', י,ט)""",
#           """(י"א,ל"ג)""",
#           """(יִהְיוּ-)""",
#           """(Biblical Verses)""",
#           """(Anochi)""",
#           """(Ani)""",
#           """(</span>Anochi)""",
#           """(Ishmael)""",
#           """(ben Joseph?)""",
#           """(and the refrain)""",
#           """(Vayyosha‘)""",
#           """(בית חדש מאת ר' יואל סירקיש)""",
#           """(מאת ר' בצלאל אשכנזי)""",
#           """(השני)""",
#           """(שמואלא כה, כא)""",
#           """(מתחיל בסוף דף כב)""",
#           """(במדבר ל, יג; ל,טז)""",
#           """(בית חדש מאת ר' יואל סירקיש)""",
#           """(מאת ר' בצלאל אשכנזי)""",
#           """("ריוח")""",
#           """("אחרית רשעים תראה")""",
#           """((""",
#           """שמות כ, יא; שמות לא, יז""",
#           """("seasilk" "byssus")""",
#           """(1777 - 1855)""",
#           """(7+1)""",
#           """(Songs)""",
#           """(?)""",
#           """(2nd ed., 2007)""",
#           """(2011)""",
#           ]
# REMOVE = [
#     """(Anochi) """,
#     'ראה',  # seems to be a typo
# ]
#
# ABBREVIATIONS = [
#     ('Is.', 'Isaiah'),
#     ('Ps.', 'Psalms'),
#     ('Ex.', 'Exodus'),
#     ('Lev.', 'Leviticus'),
#
# ]

REMOVE_CSS_CLASS = ['span-89']

